notes/meeting_2021mar21.org
* meeting notes Mar 21, 2021
** topics
*** comma has some new repl features: multi-line support
*** grammars
**** moritz lenz examples 
***** quoted strings
****** simple
****** embedded quotes
***** ini file parsing
*** nested map idioms (?)

*** looping idioms using Z (did we talk about this?)
**** https://github.com/doomvox/raku-study/blob/main/notes/bin/2021mar07/looping_over_two_parallel_arrays_via_Z.pl6
**** /home/doom/End/Cave/Perl6/Wall/raku-study/bin/2021mar07/looping_over_two_parallel_arrays_via_Z.pl6
** carried over
*** shadow novel where the bad guys speak esperanto
****  "Crime Under Cover" (1941) by Maxwell Grant
****  http://obsidianrook.com/doomfiles/LA_OMBRO.html

