notes/meeting_2021mar21.md
- [meeting notes Mar 21, 2021](#org6b5abe4)
  - [topics](#org6878b0b)
    - [comma has some new repl features: multi-line support](#orgf28de30)
    - [grammars](#org5802a59)
    - [nested map idioms (?)](#org5f72e94)
    - [looping idioms using Z (did we talk about this?)](#orgf19bf6c)
  - [carried over](#org05248c2)
    - [shadow novel where the bad guys speak esperanto](#org4e09c70)


<a id="org6b5abe4"></a>

# meeting notes Mar 21, 2021


<a id="org6878b0b"></a>

## topics


<a id="orgf28de30"></a>

### comma has some new repl features: multi-line support


<a id="org5802a59"></a>

### grammars

1.  moritz lenz examples

    1.  quoted strings
    
        1.  simple
        
        2.  embedded quotes
    
    2.  ini file parsing


<a id="org5f72e94"></a>

### nested map idioms (?)


<a id="orgf19bf6c"></a>

### looping idioms using Z (did we talk about this?)

1.  <https://github.com/doomvox/raku-study/blob/main/notes/bin/2021mar07/looping_over_two_parallel_arrays_via_Z.pl6>

2.  /home/doom/End/Cave/Perl6/Wall/raku-study/bin/2021mar07/looping<sub>over</sub><sub>two</sub><sub>parallel</sub><sub>arrays</sub><sub>via</sub><sub>Z.pl6</sub>


<a id="org05248c2"></a>

## carried over


<a id="org4e09c70"></a>

### shadow novel where the bad guys speak esperanto

1.  "Crime Under Cover" (1941) by Maxwell Grant

2.  <http://obsidianrook.com/doomfiles/LA_OMBRO.html>
